Autodesk.Revit.DB.Structure.RebarSpliceError.SpliceGeometryOnCrank
If the splice geometry is on a crank, the rebar can't be spliced with it.

Autodesk.Revit.DB.Structure.RebarSpliceError.InvalidRebar
Free Form rebars other than Morphed, or Shape Driven rebars that are Multiplanar, or have a shape whose definition is RebarShapeDefinitionByArc, or rebars that are part of a group can't be spliced.